pybricks/pybricks-micropython/lib/pbio/drv/bluetooth/bluetooth_btstack_stm32_hal.c
// SPDX-License-Identifier: MIT
// Copyright (c) 2020-2026 The Pybricks Authors

// STM32 HAL UART and GPIO driver for BlueKitchen BTStack.

// IMPORTANT: This driver requires a patched STM32 HAL to fix some data loss
// issues. See https://github.com/micropython/stm32lib/pull/12.

#include <pbdrv/config.h>

#if PBDRV_CONFIG_BLUETOOTH_BTSTACK_STM32

#include <stdint.h>

#include <btstack.h>
#undef UNUSED // btstack and stm32 both define UNUSED
#include STM32_HAL_H
#include STM32_LL_RCC_H
#include STM32_LL_USART_H

#include "bluetooth_btstack.h"
#include "bluetooth_btstack_stm32_hal.h"
#include "hci_transport_h4.h"

#include "btstack_chipset_cc256x.h"

#include <pbdrv/gpio.h>

#include <pbio/error.h>

pbio_error_t pbdrv_bluetooth_btstack_platform_init(void) {
    return PBIO_SUCCESS;
}

void pbdrv_bluetooth_btstack_platform_poll(void) {
}

void pbdrv_bluetooth_btstack_platform_packet_handler(uint8_t packet_type, uint16_t channel, uint8_t *packet, uint16_t size) {
}

const pbdrv_bluetooth_btstack_chipset_info_t *pbdrv_bluetooth_btstack_set_chipset(pbdrv_bluetooth_btstack_local_version_info_t *device_info) {

    const pbdrv_bluetooth_btstack_platform_data_t *pdata =
        &pbdrv_bluetooth_btstack_platform_data;

    // All platforms supported by this abstraction use a cc2560x with the same
    // init script.
    extern const pbdrv_bluetooth_btstack_chipset_info_t cc2564c_info;
    btstack_chipset_cc256x_set_init_script((uint8_t *)cc2564c_info.init_script, cc2564c_info.init_script_size);

    // Needed to apply init script.
    hci_set_chipset(pdata->chipset_instance());
    return &cc2564c_info;
};

static int btstack_control_gpio_on(void) {
    const pbdrv_bluetooth_btstack_stm32_platform_data_t *pdata =
        &pbdrv_bluetooth_btstack_stm32_platform_data;

    pbdrv_gpio_out_high(&pdata->enable_gpio);

    return 0;
}

static int btstack_control_gpio_off(void) {
    const pbdrv_bluetooth_btstack_stm32_platform_data_t *pdata =
        &pbdrv_bluetooth_btstack_stm32_platform_data;

    pbdrv_gpio_out_low(&pdata->enable_gpio);

    return 0;
}

static void btstack_control_gpio_init(const void *config) {
    btstack_control_gpio_off();
}

static const btstack_control_t btstack_control_gpio = {
    .init = btstack_control_gpio_init,
    .on = btstack_control_gpio_on,
    .off = btstack_control_gpio_off,
    .sleep = NULL,
    .wake = NULL,
    .register_for_power_notifications = NULL,
};

const btstack_control_t *pbdrv_bluetooth_btstack_stm32_hal_control_instance(void) {
    return &btstack_control_gpio;
}

static UART_HandleTypeDef btstack_huart;
static DMA_HandleTypeDef btstack_rx_hdma;
static DMA_HandleTypeDef btstack_tx_hdma;

// uart config
static const btstack_uart_config_t *uart_config;

// data source for integration with BTstack Runloop
static btstack_data_source_t transport_data_source;

static volatile bool send_complete;
static volatile bool receive_complete;

// callbacks
static void (*block_sent)(void);
static void (*block_received)(void);

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart) {
    send_complete = true;
    btstack_run_loop_poll_data_sources_from_irq();
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
    receive_complete = true;
    btstack_run_loop_poll_data_sources_from_irq();
}

static int btstack_stm32_hal_init(const btstack_uart_config_t *config) {
    const pbdrv_bluetooth_btstack_stm32_platform_data_t *pdata =
        &pbdrv_bluetooth_btstack_stm32_platform_data;

    uart_config = config;

    btstack_tx_hdma.Instance = pdata->tx_dma;
    #if defined(STM32H5)
    btstack_tx_hdma.Init.Request = pdata->tx_dma_req;
    btstack_tx_hdma.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
    btstack_tx_hdma.Init.Direction = DMA_MEMORY_TO_PERIPH;
    btstack_tx_hdma.Init.SrcInc = DMA_SINC_INCREMENTED;
    btstack_tx_hdma.Init.DestInc = DMA_DINC_FIXED;
    btstack_tx_hdma.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_BYTE;
    btstack_tx_hdma.Init.DestDataWidth = DMA_DEST_DATAWIDTH_BYTE;
    btstack_tx_hdma.Init.Priority = DMA_HIGH_PRIORITY;
    btstack_tx_hdma.Init.SrcBurstLength = 1;
    btstack_tx_hdma.Init.DestBurstLength = 1;
    btstack_tx_hdma.Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT0;
    btstack_tx_hdma.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
    btstack_tx_hdma.Init.Mode = DMA_NORMAL;
    #else
    btstack_tx_hdma.Init.Channel = pdata->tx_dma_ch;
    btstack_tx_hdma.Init.Direction = DMA_MEMORY_TO_PERIPH;
    btstack_tx_hdma.Init.PeriphInc = DMA_PINC_DISABLE;
    btstack_tx_hdma.Init.MemInc = DMA_MINC_ENABLE;
    btstack_tx_hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    btstack_tx_hdma.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    btstack_tx_hdma.Init.Mode = DMA_NORMAL;
    btstack_tx_hdma.Init.Priority = DMA_PRIORITY_VERY_HIGH;
    btstack_tx_hdma.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    btstack_tx_hdma.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_1QUARTERFULL;
    btstack_tx_hdma.Init.MemBurst = DMA_MBURST_SINGLE;
    btstack_tx_hdma.Init.PeriphBurst = DMA_PBURST_SINGLE;
    #endif
    HAL_DMA_Init(&btstack_tx_hdma);

    btstack_rx_hdma.Instance = pdata->rx_dma;
    #if defined(STM32H5)
    btstack_rx_hdma.Init.Request = pdata->rx_dma_req;
    btstack_rx_hdma.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
    btstack_rx_hdma.Init.Direction = DMA_PERIPH_TO_MEMORY;
    btstack_rx_hdma.Init.SrcInc = DMA_SINC_FIXED;
    btstack_rx_hdma.Init.DestInc = DMA_DINC_INCREMENTED;
    btstack_rx_hdma.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_BYTE;
    btstack_rx_hdma.Init.DestDataWidth = DMA_DEST_DATAWIDTH_BYTE;
    btstack_rx_hdma.Init.Priority = DMA_HIGH_PRIORITY;
    btstack_rx_hdma.Init.SrcBurstLength = 1;
    btstack_rx_hdma.Init.DestBurstLength = 1;
    btstack_rx_hdma.Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT0;
    btstack_rx_hdma.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
    btstack_rx_hdma.Init.Mode = DMA_NORMAL;
    #else
    btstack_rx_hdma.Init.Channel = pdata->rx_dma_ch;
    btstack_rx_hdma.Init.Direction = DMA_PERIPH_TO_MEMORY;
    btstack_rx_hdma.Init.PeriphInc = DMA_PINC_DISABLE;
    btstack_rx_hdma.Init.MemInc = DMA_MINC_ENABLE;
    btstack_rx_hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    btstack_rx_hdma.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    btstack_rx_hdma.Init.Mode = DMA_NORMAL;
    btstack_rx_hdma.Init.Priority = DMA_PRIORITY_VERY_HIGH;
    btstack_rx_hdma.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    btstack_rx_hdma.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_1QUARTERFULL;
    btstack_rx_hdma.Init.MemBurst = DMA_MBURST_SINGLE;
    btstack_rx_hdma.Init.PeriphBurst = DMA_PBURST_SINGLE;
    #endif
    HAL_DMA_Init(&btstack_rx_hdma);

    btstack_huart.Instance = pdata->uart;
    btstack_huart.Init.BaudRate = config->baudrate;
    btstack_huart.Init.WordLength = UART_WORDLENGTH_8B;
    btstack_huart.Init.StopBits = UART_STOPBITS_1;
    btstack_huart.Init.Parity = UART_PARITY_NONE;
    btstack_huart.Init.Mode = UART_MODE_TX_RX;
    btstack_huart.Init.HwFlowCtl = config->flowcontrol ? UART_HWCONTROL_RTS_CTS : UART_HWCONTROL_NONE;
    btstack_huart.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&btstack_huart);

    __HAL_LINKDMA(&btstack_huart, hdmatx, btstack_tx_hdma);
    __HAL_LINKDMA(&btstack_huart, hdmarx, btstack_rx_hdma);

    HAL_NVIC_SetPriority(pdata->tx_dma_irq, 1, 2);
    HAL_NVIC_EnableIRQ(pdata->tx_dma_irq);
    HAL_NVIC_SetPriority(pdata->rx_dma_irq, 1, 1);
    HAL_NVIC_EnableIRQ(pdata->rx_dma_irq);
    HAL_NVIC_SetPriority(pdata->uart_irq, 1, 0);
    HAL_NVIC_EnableIRQ(pdata->uart_irq);

    return 0;
}

static void btstack_stm32_hal_process(btstack_data_source_t *ds, btstack_data_source_callback_type_t callback_type) {
    switch (callback_type) {
        case DATA_SOURCE_CALLBACK_POLL:
            if (send_complete) {
                send_complete = false;
                if (block_sent) {
                    block_sent();
                }
            }
            if (receive_complete) {
                receive_complete = false;
                if (block_received) {
                    block_received();
                }
            }
            break;
        default:
            break;
    }
}

// TODO: use pbdrv_uart_set_baud_rate() - it is identical
#if defined(STM32F4)
static int btstack_stm32_hal_set_baudrate(uint32_t baud) {
    USART_TypeDef *usart = btstack_huart.Instance;
    uint32_t periphclk = LL_RCC_PERIPH_FREQUENCY_NO;
    LL_RCC_ClocksTypeDef rcc_clocks;

    LL_RCC_GetSystemClocksFreq(&rcc_clocks);
    if (usart == USART1
        #if defined(USART6)
        || usart == USART6
        #endif
        #if defined(UART9)
        || usart == UART9
        #endif
        #if defined(UART10)
        || usart == UART10
        #endif
        ) {
        periphclk = rcc_clocks.PCLK2_Frequency;
    } else {
        periphclk = rcc_clocks.PCLK1_Frequency;
    }

    LL_USART_SetBaudRate(usart, periphclk, LL_USART_OVERSAMPLING_16, baud);

    return 0;
}
#elif defined(STM32H5)
static int btstack_stm32_hal_set_baudrate(uint32_t baud) {
    USART_TypeDef *usart = btstack_huart.Instance;
    uint32_t periphclk = LL_RCC_PERIPH_FREQUENCY_NO;

    if (usart == USART1) {
        periphclk = LL_RCC_GetUSARTClockFreq(LL_RCC_USART1_CLKSOURCE);
    } else if (usart == USART2) {
        periphclk = LL_RCC_GetUSARTClockFreq(LL_RCC_USART2_CLKSOURCE);
    } else if (usart == USART3) {
        periphclk = LL_RCC_GetUSARTClockFreq(LL_RCC_USART3_CLKSOURCE);
    }
    #if defined(UART4)
    else if (usart == UART4) {
        periphclk = LL_RCC_GetUARTClockFreq(LL_RCC_UART4_CLKSOURCE);
    }
    #endif /* UART4 */
    #if defined(UART5)
    else if (usart == UART5) {
        periphclk = LL_RCC_GetUARTClockFreq(LL_RCC_UART5_CLKSOURCE);
    }
    #endif /* UART5 */
    #if defined(USART6)
    else if (usart == USART6) {
        periphclk = LL_RCC_GetUSARTClockFreq(LL_RCC_USART6_CLKSOURCE);
    }
    #endif /* USART6 */
    #if defined(UART7)
    else if (usart == UART7) {
        periphclk = LL_RCC_GetUARTClockFreq(LL_RCC_UART7_CLKSOURCE);
    }
    #endif /* UART7 */
    #if defined(UART8)
    else if (usart == UART8) {
        periphclk = LL_RCC_GetUARTClockFreq(LL_RCC_UART8_CLKSOURCE);
    }
    #endif /* UART8 */
    #if defined(UART9)
    else if (usart == UART9) {
        periphclk = LL_RCC_GetUSARTClockFreq(LL_RCC_UART9_CLKSOURCE);
    }
    #endif /* UART9 */
    #if defined(USART10)
    else if (usart == USART10) {
        periphclk = LL_RCC_GetUSARTClockFreq(LL_RCC_USART10_CLKSOURCE);
    }
    #endif /* USART10 */
    #if defined(USART11)
    else if (usart == USART11) {
        periphclk = LL_RCC_GetUSARTClockFreq(LL_RCC_USART11_CLKSOURCE);
    }
    #endif /* USART11 */
    #if defined(UART12)
    else if (usart == UART12) {
        periphclk = LL_RCC_GetUARTClockFreq(LL_RCC_UART12_CLKSOURCE);
    }
    #endif /* UART12 */

    // TODO: confirm that we don't need different prescalar.
    // i.e. assert_param(IS_LL_USART_BRR_MIN(USARTx->BRR))
    LL_USART_SetBaudRate(usart, periphclk, LL_USART_PRESCALER_DIV1, LL_USART_OVERSAMPLING_16, baud);
    LL_USART_SetPrescaler(usart, LL_USART_PRESCALER_DIV1);

    return 0;
}
#else
#error "unsupported MCU for btstack_stm32_hal_set_baudrate()"
#endif

static int btstack_stm32_hal_open(void) {
    btstack_stm32_hal_set_baudrate(uart_config->baudrate);

    // set up polling data_source
    btstack_run_loop_set_data_source_handler(&transport_data_source, &btstack_stm32_hal_process);
    btstack_run_loop_enable_data_source_callbacks(&transport_data_source, DATA_SOURCE_CALLBACK_POLL);
    btstack_run_loop_add_data_source(&transport_data_source);

    return 0;
}

static int btstack_stm32_hal_close(void) {
    // remove data source
    btstack_run_loop_disable_data_source_callbacks(&transport_data_source, DATA_SOURCE_CALLBACK_POLL);
    btstack_run_loop_remove_data_source(&transport_data_source);

    return 0;
}

static void btstack_stm32_hal_set_block_received(void (*handler)(void)) {
    block_received = handler;
}

static void btstack_stm32_hal_set_block_sent(void (*handler)(void)) {
    block_sent = handler;
}

static int btstack_stm32_hal_set_parity(int parity) {
    return 0;
}

static void btstack_stm32_hal_receive_block(uint8_t *buffer, uint16_t len) {
    HAL_UART_Receive_DMA(&btstack_huart, buffer, len);
}

static void btstack_stm32_hal_send_block(const uint8_t *data, uint16_t size) {
    HAL_UART_Transmit_DMA(&btstack_huart, (uint8_t *)data, size);
}

static const btstack_uart_block_t btstack_stm32_hal = {
    .init = btstack_stm32_hal_init,
    .open = btstack_stm32_hal_open,
    .close = btstack_stm32_hal_close,
    .set_block_received = btstack_stm32_hal_set_block_received,
    .set_block_sent = btstack_stm32_hal_set_block_sent,
    .set_baudrate = btstack_stm32_hal_set_baudrate,
    .set_parity = btstack_stm32_hal_set_parity,
    .set_flowcontrol = NULL,
    .receive_block = btstack_stm32_hal_receive_block,
    .send_block = btstack_stm32_hal_send_block,
    .get_supported_sleep_modes = NULL,
    .set_sleep = NULL,
    .set_wakeup_handler = NULL,
};

const hci_transport_t *pbdrv_bluetooth_btstack_stm32_hal_transport_instance(void) {
    return hci_transport_h4_instance_for_uart(&btstack_stm32_hal);
}

const void *pbdrv_bluetooth_btstack_stm32_hal_transport_config(void) {
    // Note on baud rate: with a 48MHz clock, 3000000 baud is the highest we can
    // go with LL_USART_OVERSAMPLING_16. With LL_USART_OVERSAMPLING_8 we could
    // go to 4000000, which is the max rating of the CC2564C.
    static const hci_transport_config_uart_t config = {
        .type = HCI_TRANSPORT_CONFIG_UART,
        .baudrate_init = 115200,
        .baudrate_main = 3000000,
        .flowcontrol = 1,
        .device_name = NULL,
    };
    return &config;
}

void pbdrv_bluetooth_btstack_stm32_hal_handle_tx_dma_irq(void) {
    HAL_DMA_IRQHandler(&btstack_tx_hdma);
}

void pbdrv_bluetooth_btstack_stm32_hal_handle_rx_dma_irq(void) {
    HAL_DMA_IRQHandler(&btstack_rx_hdma);
}

void pbdrv_bluetooth_btstack_stm32_hal_handle_uart_irq(void) {
    HAL_UART_IRQHandler(&btstack_huart);
}

#endif // PBDRV_CONFIG_BLUETOOTH_BTSTACK_STM32
